In [1]:
import pandas as pd

In [2]:
from HKRECON import main

In [6]:
df = main("Sheet1 (14).xlsx")

c:\Users\GakuTokusumi\AppData\Local\Programs\Python\Python311\Lib\site-packages\openpyxl\styles\stylesheet.py:226: UserWarning: Workbook contains no default style, apply openpyxl's default
  warn("Workbook contains no default style, apply openpyxl's default")

In [9]:
df

,King Stayover,King Checkout,Queen Stayover,Queen Checkout
"Aleman, Mariana",3,7,2,4
"Avila, Andrea",3,8,0,5
"Castro, Julio",1,10,2,3
"Contreras, Juan Carlos",0,7,4,4
"Lopez, Emir",3,8,0,4
"Quick, Cheyenne",2,8,1,4
"Romero, Johana",3,7,1,4

In [10]:
len(df) #gets the number of employees

7

In [25]:
df.columns = ['2','3','4','5']

In [26]:
df.head()

                        2   3  4  5
Aleman, Mariana         3   7  2  4
Avila, Andrea           3   8  0  5
Castro, Julio           1  10  2  3
Contreras, Juan Carlos  0   7  4  4
Lopez, Emir             3   8  0  4

In [27]:
empNum = len(df)
for j in range(0,empNum): # row value
    for i in range(2,6): # column value
        print(df.iloc[j][str(i)])

3
7
2
4
3
8
0
5
1
10
2
3
0
7
4
4
3
8
0
4
2
8
1
4
3
7
1
4

In [1]:
a, b = 1,8
print([str(i) for i in range(a,b)])

['1', '2', '3', '4', '5', '6', '7']